//Сделайте ваш чат сетевым, то есть доработайте его так, чтобы два экземпляра программы могли отправлять и принимать сообщения между собой.
//
//Используйте протокол UDP или TCP на свое усмотрение.
//
//Можно использовать архитектуру клиент - сервер, в этом случае будут две программы — клиент и сервер.
//Можно использовать децентрализованную(англ.peer - to - peer, P2P — равный к равному) сеть, в которой каждый узел является как клиентом, так и выполняет функции сервера.
//Проект чата следует загрузить в свой репозиторий на GitHub.
//
//Тем из вас, кто уже был знаком с Linux, и потому первую часть модулей проходит быстро, мы приготовили в каждом из модулей итоговое задание со звездочкой.Вы можете выбрать его для реализации.Оно будет засчитываться так же, как и обычное задание, но будет посложнее и поинтереснее, и у вас будет возможность прокачать свои скиллы более глубоко.
//
//Задание повышенной сложности(то самое, со звездочкой*)
//
//Сделайте ваш чат кроссплатформенным, т.е.чтобы он компилировался и работал в Linux и в Windows.